/******************************************************************************
  * 文件名程: main.c 
  * 作    者: 硬石嵌入式开发团队
  * 版    本: V1.0
  * 编写日期: 2015-10-04
  * 功    能: 标准库函数编程工程模板
  ******************************************************************************
  * 说明：
  * 本例程配套硬石stm32开发板YS-F1Pro使用。
  * 
  * 淘宝：
  * 论坛：http://www.ing10bbs.com
  * 版权归硬石嵌入式开发团队所有，请勿商用。
  ******************************************************************************
  */

/* 包含头文件 ----------------------------------------------------------------*//* Includes ------------------------------------------------------------------*/
#include "common.h"

/* 私有类型定义 --------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/
/* 私有变量 ------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
/* 私有函数原形 --------------------------------------------------------------*/
static uint16_t timecount;
/* 函数体 --------------------------------------------------------------------*/

/**
  * 函数功能: 主函数.
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  */
int main(void)
{
	/* 初始化硬件 */ 
  Bsp_init();
	
	/* 清零时间计数 */ 
  timecount=0;
	printf("System is start \n");
  /* 无限循环 */
  while (1)
  {
		Delay_ms(500);
		LED1_TOGGLE;
  }
}


#ifdef  USE_FULL_ASSERT

/**
  * 函数功能: 报告名称的源文件和源代码行数，assert_param错误已经发生。
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明：
  *           
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* 用户可以添加自己的执行情况来报告文件名和行数,
     例子: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* 无限循环 */
  while (1)
  {
  }
}
#endif

/**
  * @}
  */

/******************* (C) COPYRIGHT 2015-2020 硬石嵌入式开发团队 *****END OF FILE****/
